## Plan Result (826: deploy - PlanAndApply)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_access_package.package[&#34;DTS Azure PIM Approvers Access&#34;]
  * azuread_access_package_assignment_policy.this[&#34;self-approval-with-justification:DTS Azure PIM Approvers Access&#34;]
  * azuread_access_package_catalog.catalog[&#34;DTS Azure PIM Approvers Access&#34;]
  * azuread_access_package_catalog_role_assignment.groups[&#34;DTS Azure PIM Approvers Access&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;DTS Azure PIM Approvers Access:DTS Azure PIM Approvers (CNP)&#34;]
  * azuread_access_package_resource_package_association.this[&#34;DTS Azure PIM Approvers Access:DTS Azure PIM Approvers Access:DTS Azure PIM Approvers (CNP)&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_access_package.package["DTS Azure PIM Approvers Access"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = (known after apply)
      + description  = "Grants access to DTS Azure PIM Approvers group"
      + display_name = "DTS Azure PIM Approvers Access"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package_assignment_policy.this["self-approval-with-justification:DTS Azure PIM Approvers Access"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required                = false
          + requestor_justification_required = true
        }

      + question {
          + required = false
          + sequence = 1

          + text {
              + default_text = "Include Jira link in business justification"
            }
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "d99d09e7-9602-48f0-a461-3b0cf6c3b4a5"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_catalog.catalog["DTS Azure PIM Approvers Access"] will be created
  + resource "azuread_access_package_catalog" "catalog" {
      + description        = "DTS Azure PIM Approvers Access"
      + display_name       = "DTS Azure PIM Approvers Access"
      + externally_visible = false
      + id                 = (known after apply)
      + published          = true
    }

  # azuread_access_package_catalog_role_assignment.groups["DTS Azure PIM Approvers Access"] will be created
  + resource "azuread_access_package_catalog_role_assignment" "groups" {
      + catalog_id          = (known after apply)
      + id                  = (known after apply)
      + principal_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + role_id             = "ae79f266-94d4-4dab-b730-feca7e132178"
    }

  # azuread_access_package_resource_catalog_association.this["DTS Azure PIM Approvers Access:DTS Azure PIM Approvers (CNP)"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = (known after apply)
      + id                     = (known after apply)
      + resource_origin_id     = "cfdbb1cc-e789-4d2c-b390-1d9ed77603d3"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_package_association.this["DTS Azure PIM Approvers Access:DTS Azure PIM Approvers Access:DTS Azure PIM Approvers (CNP)"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":125,"Program":"tfcmt","SHA1":"","Target":"826: deploy - PlanAndApply","Vars":{}} -->